In [2]:
#import packages 
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import plotly.express as px

In [3]:
#load data
data_grad = pd.read_csv("data/grad rates.csv")
data_teacher = pd.read_csv("data/avgclsrmsal.csv", header=3)

In [4]:
data_teacher.head(5)

,Dist No,District name,1989-90,1990-91,1991-92,1992-93,1993-94,1994-95,1995-96,1996-97,...,2015-16,2016-17,2017-18,2018-19,2019-20,2020-21,2021-22,2022-23,2023-24,2024-25
0,001,ADAIR,"$25,779","$27,714","$30,002","$30,069","$29,819","$30,971","$31,371","$32,233",...,"$47,999","$47,775","$50,925","$51,127","$50,685","$51,120","$50,610","$53,609","$53,316","$54,377"
1,005,ALLEN,"$25,480","$27,825","$29,139","$29,645","$30,635","$31,410","$31,770","$32,364",...,"$50,109","$49,742","$49,817","$49,990","$50,617","$52,210","$52,639","$52,625","$53,942","$56,471"
2,006,ANCHORAGE,"$28,736","$31,003","$32,966","$34,826","$34,901","$36,072","$36,410","$36,854",...,"$61,594","$63,083","$62,491","$67,488","$68,644","$68,151","$71,634","$73,766","$78,052","$77,086"
3,011,ANDERSON,"$24,692","$27,390","$29,186","$29,901","$30,513","$31,309","$31,977","$32,711",...,"$48,471","$48,122","$48,517","$49,381","$49,769","$51,073","$51,342","$52,551","$54,636","$56,853"
4,012,ASHLAND,"$27,422","$30,155","$31,395","$31,792","$32,745","$33,207","$33,117","$34,216",...,"$50,265","$50,203","$49,313","$48,992","$49,741","$50,508","$51,027","$51,083","$52,141","$54,359"

In [5]:
data_grad.head(5)

,District name,1989-90,1990-91,1991-92,1992-93,1993-94,1994-95,1995-96,1996-97,1997-98,...,2015-16,2016-17,2017-18,2018-19,2019-20,2020-21,2021-22,2022-23,2023-24,2024-25
0,ADAIR,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,97.0,NaN,NaN
1,ALLEN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,93.1,NaN,NaN
2,ANCHORAGE,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,ANDERSON,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,92.4,NaN,NaN
4,ASHLAND,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [6]:
#column names
data_grad.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 176 entries, 0 to 175
Data columns (total 37 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   District name  176 non-null    object
 1   1989-90        0 non-null      float64
 2   1990-91        0 non-null      float64
 3   1991-92        0 non-null      float64
 4   1992-93        0 non-null      float64
 5   1993-94        0 non-null      float64
 6   1994-95        0 non-null      float64
 7   1995-96        0 non-null      float64
 8   1996-97        0 non-null      float64
 9   1997-98        0 non-null      float64
 10  1998-99        0 non-null      float64
 11  1999-00        0 non-null      float64
 12  2000-01        0 non-null      float64
 13  2001-02        0 non-null      float64
 14   2002-03       171 non-null    float64
 15   2003-04       171 non-null    float64
 16  2004-05        171 non-null    float64
 17  2005-06        171 non-null    float64
 18  2006-07        169 non-null    float64
 19  2007-08        170 non-null    float64
 20  2008-09        169 non-null    float64
 21  2009-10        0 non-null      float64
 22  2010-11        0 non-null      float64
 23  2011-12        0 non-null      float64
 24  2012-13        0 non-null      float64
 25  2013-14        0 non-null      float64
 26  2014-15        0 non-null      float64
 27  2015-16        0 non-null      float64
 28  2016-17        0 non-null      float64
 29  2017-18        0 non-null      float64
 30  2018-19        0 non-null      float64
 31  2019-20        0 non-null      float64
 32  2020-21        0 non-null      float64
 33  2021-22        0 non-null      float64
 34  2022-23        165 non-null    float64
 35  2023-24        0 non-null      float64
 36  2024-25        0 non-null      float64
dtypes: float64(36), object(1)
memory usage: 51.0+ KB

In [7]:
data_grad.head(5)

,District name,1989-90,1990-91,1991-92,1992-93,1993-94,1994-95,1995-96,1996-97,1997-98,...,2015-16,2016-17,2017-18,2018-19,2019-20,2020-21,2021-22,2022-23,2023-24,2024-25
0,ADAIR,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,97.0,NaN,NaN
1,ALLEN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,93.1,NaN,NaN
2,ANCHORAGE,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,ANDERSON,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,92.4,NaN,NaN
4,ASHLAND,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [8]:
data_grad.drop("1989-90", inplace=True, axis=1)
data_grad.drop("1990-91", inplace=True, axis=1)
data_grad.drop("1991-92", inplace=True, axis=1)
data_grad.drop("1992-93", inplace=True, axis=1)
data_grad.drop("1993-94", inplace=True, axis=1)
data_grad.drop("1994-95", inplace=True, axis=1)
data_grad.drop("1995-96", inplace=True, axis=1)
data_grad.drop("1996-97", inplace=True, axis=1)
data_grad.drop("1997-98", inplace=True, axis=1)
data_grad.drop("1998-99", inplace=True, axis=1)
data_grad.drop("1999-00", inplace=True, axis=1)
data_grad.drop("2000-01", inplace=True, axis=1)
data_grad.drop("2001-02", inplace=True, axis=1)
#data_grad.drop("1992-93", inplace=True, axis=1)
#data_grad.drop("1993-94", inplace=True, axis=1)
#data_grad.drop("1994-95", inplace=True, axis=1)
data_teacher.drop("1989-90", inplace=True, axis=1)
data_teacher.drop("1990-91", inplace=True, axis=1)
data_teacher.drop("1991-92", inplace=True, axis=1)
data_teacher.drop("1992-93", inplace=True, axis=1)
data_teacher.drop("1993-94", inplace=True, axis=1)
data_teacher.drop("1994-95", inplace=True, axis=1)
data_teacher.drop("1995-96", inplace=True, axis=1)
data_teacher.drop("1996-97", inplace=True, axis=1)
data_teacher.drop("1997-98", inplace=True, axis=1)
data_teacher.drop("1998-99", inplace=True, axis=1)
data_teacher.drop("1999-00", inplace=True, axis=1)
data_teacher.drop("2000-01", inplace=True, axis=1)
data_teacher.drop("2001-02", inplace=True, axis=1)

In [9]:
data_teacher.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 192 entries, 0 to 191
Data columns (total 25 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Dist No        189 non-null    object
 1   District name  177 non-null    object
 2    2002-03       177 non-null    object
 3    2003-04       177 non-null    object
 4   2004-05        177 non-null    object
 5   2005-06        177 non-null    object
 6   2006-07        177 non-null    object
 7   2007-08        176 non-null    object
 8   2008-09        175 non-null    object
 9   2009-10        175 non-null    object
 10  2010-11        175 non-null    object
 11  2011-12        175 non-null    object
 12  2012-13        175 non-null    object
 13  2013-14        174 non-null    object
 14  2014-15        174 non-null    object
 15  2015-16        174 non-null    object
 16  2016-17        174 non-null    object
 17  2017-18        174 non-null    object
 18  2018-19        174 non-null    object
 19  2019-20        173 non-null    object
 20  2020-21        173 non-null    object
 21  2021-22        173 non-null    object
 22  2022-23        172 non-null    object
 23  2023-24        172 non-null    object
 24  2024-25        172 non-null    object
dtypes: object(25)
memory usage: 37.6+ KB

In [10]:
data_grad.isnull().sum()

District name      0
 2002-03           5
 2003-04           5
2004-05            5
2005-06            5
2006-07            7
2007-08            6
2008-09            7
2009-10          176
2010-11          176
2011-12          176
2012-13          176
2013-14          176
2014-15          176
2015-16          176
2016-17          176
2017-18          176
2018-19          176
2019-20          176
2020-21          176
2021-22          176
2022-23           11
2023-24          176
2024-25          176
dtype: int64

In [ ]:
#Merge two data frames
merged_df = pd.merge(data_grad, data_teacher, left_on="District name", right_on="District name")
merged_df.head(5)

,District name,2002-03 _x,2003-04 _x,2004-05_x,2005-06_x,2006-07_x,2007-08_x,2008-09_x,2009-10_x,2010-11_x,...,2015-16_y,2016-17_y,2017-18_y,2018-19_y,2019-20_y,2020-21_y,2021-22_y,2022-23_y,2023-24_y,2024-25_y
0,ADAIR,66.0,74.0,85.0,72.0,83.0,82.0,86.0,NaN,NaN,...,"$47,999","$47,775","$50,925","$51,127","$50,685","$51,120","$50,610","$53,609","$53,316","$54,377"
1,ALLEN,74.0,83.0,83.0,89.0,88.0,83.0,83.0,NaN,NaN,...,"$50,109","$49,742","$49,817","$49,990","$50,617","$52,210","$52,639","$52,625","$53,942","$56,471"
2,ANCHORAGE,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,"$61,594","$63,083","$62,491","$67,488","$68,644","$68,151","$71,634","$73,766","$78,052","$77,086"
3,ANDERSON,88.0,86.0,86.0,86.0,90.0,90.0,89.0,NaN,NaN,...,"$48,471","$48,122","$48,517","$49,381","$49,769","$51,073","$51,342","$52,551","$54,636","$56,853"
4,ASHLAND,86.0,87.0,85.0,84.0,83.0,84.0,88.0,NaN,NaN,...,"$50,265","$50,203","$49,313","$48,992","$49,741","$50,508","$51,027","$51,083","$52,141","$54,359"

In [12]:
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 176 entries, 0 to 175
Data columns (total 48 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   District name  176 non-null    object
 1    2002-03 _x    171 non-null    float64
 2    2003-04 _x    171 non-null    float64
 3   2004-05_x      171 non-null    float64
 4   2005-06_x      171 non-null    float64
 5   2006-07_x      169 non-null    float64
 6   2007-08_x      170 non-null    float64
 7   2008-09_x      169 non-null    float64
 8   2009-10_x      0 non-null      float64
 9   2010-11_x      0 non-null      float64
 10  2011-12_x      0 non-null      float64
 11  2012-13_x      0 non-null      float64
 12  2013-14_x      0 non-null      float64
 13  2014-15_x      0 non-null      float64
 14  2015-16_x      0 non-null      float64
 15  2016-17_x      0 non-null      float64
 16  2017-18_x      0 non-null      float64
 17  2018-19_x      0 non-null      float64
 18  2019-20_x      0 non-null      float64
 19  2020-21_x      0 non-null      float64
 20  2021-22_x      0 non-null      float64
 21  2022-23_x      165 non-null    float64
 22  2023-24_x      0 non-null      float64
 23  2024-25_x      0 non-null      float64
 24  Dist No        176 non-null    object
 25   2002-03 _y    176 non-null    object
 26   2003-04 _y    176 non-null    object
 27  2004-05_y      176 non-null    object
 28  2005-06_y      176 non-null    object
 29  2006-07_y      176 non-null    object
 30  2007-08_y      175 non-null    object
 31  2008-09_y      174 non-null    object
 32  2009-10_y      174 non-null    object
 33  2010-11_y      174 non-null    object
 34  2011-12_y      174 non-null    object
 35  2012-13_y      174 non-null    object
 36  2013-14_y      173 non-null    object
 37  2014-15_y      173 non-null    object
 38  2015-16_y      173 non-null    object
 39  2016-17_y      173 non-null    object
 40  2017-18_y      173 non-null    object
 41  2018-19_y      173 non-null    object
 42  2019-20_y      172 non-null    object
 43  2020-21_y      172 non-null    object
 44  2021-22_y      172 non-null    object
 45  2022-23_y      171 non-null    object
 46  2023-24_y      171 non-null    object
 47  2024-25_y      171 non-null    object
dtypes: float64(23), object(25)
memory usage: 66.1+ KB

In [13]:
merged_df.isnull().sum()

District name      0
 2002-03 _x        5
 2003-04 _x        5
2004-05_x          5
2005-06_x          5
2006-07_x          7
2007-08_x          6
2008-09_x          7
2009-10_x        176
2010-11_x        176
2011-12_x        176
2012-13_x        176
2013-14_x        176
2014-15_x        176
2015-16_x        176
2016-17_x        176
2017-18_x        176
2018-19_x        176
2019-20_x        176
2020-21_x        176
2021-22_x        176
2022-23_x         11
2023-24_x        176
2024-25_x        176
Dist No            0
 2002-03 _y        0
 2003-04 _y        0
2004-05_y          0
2005-06_y          0
2006-07_y          0
2007-08_y          1
2008-09_y          2
2009-10_y          2
2010-11_y          2
2011-12_y          2
2012-13_y          2
2013-14_y          3
2014-15_y          3
2015-16_y          3
2016-17_y          3
2017-18_y          3
2018-19_y          3
2019-20_y          4
2020-21_y          4
2021-22_y          4
2022-23_y          5
2023-24_y          5
2024-25_y          5
dtype: int64